; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s1-p10-a1)

(:domain logistics)

(:objects a0 - airplane
          c0 c1 - city
          t0 t1 t2 t3 t4 t5 - truck
          l0-0 l1-0 - airport
          p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l0-0)
    (at t3 l1-0)
    (at t4 l1-0)
    (at t5 l0-0)
    (at p0 l0-0)
    (at p1 l0-0)
    (at p2 l0-0)
    (at p3 l0-0)
    (at p4 l1-0)
    (at p5 l1-0)
    (at p6 l0-0)
    (at p7 l0-0)
    (at p8 l0-0)
    (at p9 l0-0)
    (at a0 l1-0)
)

(:goal
    (and
        (at p0 l1-0)
        (at p1 l0-0)
        (at p2 l1-0)
        (at p3 l1-0)
        (at p4 l1-0)
        (at p5 l1-0)
        (at p6 l1-0)
        (at p7 l0-0)
        (at p8 l0-0)
        (at p9 l0-0)
    )
)
)

; plan
1. (load t0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 t0)
   goals met: 6 of 10
2. (load t0 p1 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t0)
   goals met: 5 of 10
3. (load t0 p2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 t0)
   goals met: 5 of 10
4. (load t0 p3 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 5 of 10
5. (load t0 p6 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 t0)
   goals met: 5 of 10
6. (load t0 p7 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 t0)
   goals met: 4 of 10
7. (load t0 p8 l0-0)
   deleted: (at p8 l0-0)
   added: (in p8 t0)
   goals met: 3 of 10
8. (load t0 p9 l0-0)
   deleted: (at p9 l0-0)
   added: (in p9 t0)
   goals met: 2 of 10
9. (load t1 p4 l1-0)
   deleted: (at p4 l1-0)
   added: (in p4 t1)
   goals met: 1 of 10
10. (load t1 p5 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 0 of 10
11. (fly a0 l1-0 l0-0)
   deleted: (at a0 l1-0)
   added: (at a0 l0-0)
   goals met: 0 of 10
12. (unload t0 p0 l0-0)
   deleted: (in p0 t0)
   added: (at p0 l0-0)
   goals met: 0 of 10
13. (unload t0 p2 l0-0)
   deleted: (in p2 t0)
   added: (at p2 l0-0)
   goals met: 0 of 10
14. (unload t0 p3 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 0 of 10
15. (unload t0 p6 l0-0)
   deleted: (in p6 t0)
   added: (at p6 l0-0)
   goals met: 0 of 10
16. (load a0 p0 l0-0)
   deleted: (at p0 l0-0)
   added: (in p0 a0)
   goals met: 0 of 10
17. (load a0 p2 l0-0)
   deleted: (at p2 l0-0)
   added: (in p2 a0)
   goals met: 0 of 10
18. (load a0 p3 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 a0)
   goals met: 0 of 10
19. (load a0 p6 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 0 of 10
20. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 10
21. (unload a0 p0 l1-0)
   deleted: (in p0 a0)
   added: (at p0 l1-0)
   goals met: 1 of 10
22. (unload a0 p2 l1-0)
   deleted: (in p2 a0)
   added: (at p2 l1-0)
   goals met: 2 of 10
23. (unload a0 p3 l1-0)
   deleted: (in p3 a0)
   added: (at p3 l1-0)
   goals met: 3 of 10
24. (unload a0 p6 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 4 of 10
25. (unload t0 p1 l0-0)
   deleted: (in p1 t0)
   added: (at p1 l0-0)
   goals met: 5 of 10
26. (unload t0 p7 l0-0)
   deleted: (in p7 t0)
   added: (at p7 l0-0)
   goals met: 6 of 10
27. (unload t0 p8 l0-0)
   deleted: (in p8 t0)
   added: (at p8 l0-0)
   goals met: 7 of 10
28. (unload t0 p9 l0-0)
   deleted: (in p9 t0)
   added: (at p9 l0-0)
   goals met: 8 of 10
29. (unload t1 p4 l1-0)
   deleted: (in p4 t1)
   added: (at p4 l1-0)
   goals met: 9 of 10
30. (unload t1 p5 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 10 of 10
